pycom/pycom-micropython-sigfox/esp32/mptask.c
/*
 * Copyright (c) 2020, Pycom Limited.
 *
 * This software is licensed under the GNU GPL version 3 or any
 * later version, with permitted additional terms. For more information
 * see the Pycom Licence v1.0 document supplied with this file, or
 * available at https://www.pycom.io/opensource/licensing
 */

#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
#include <ctype.h>
#include <stddef.h>

#include "esp_heap_caps.h"
#include "sdkconfig.h"
#include "esp_err.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event_loop.h"
#include "nvs_flash.h"
#include "esp_spi_flash.h"
#include "soc/cpu.h"

#include "py/mpconfig.h"
#include "py/stackctrl.h"
#include "py/obj.h"
#include "py/runtime.h"
#include "py/compile.h"
#include "py/gc.h"
#include "py/mphal.h"
#include "lib/utils/pyexec.h"
#include "readline.h"
#include "esp32_mphal.h"
#include "machuart.h"
#include "machwdt.h"
#include "machpin.h"
#include "moduos.h"
#include "mperror.h"
#include "mpirq.h"
#include "serverstask.h"
#include "modnetwork.h"
#include "modwlan.h"
#include "modusocket.h"
#include "antenna.h"
#include "modled.h"
#include "esp_log.h"
#include "mods/pybflash.h"

#if defined (LOPY) || defined (LOPY4) || defined (FIPY)
#include "modlora.h"
#endif
#if defined (SIPY) || defined(LOPY4) || defined (FIPY)
#include "sigfox/modsigfox.h"
#endif
#if defined (GPY) || defined (FIPY)
#include "modlte.h"
#endif

#include "random.h"
#include "bootmgr.h"
#include "updater.h"
#include "pycom_config.h"
#include "mpsleep.h"
#include "machrtc.h"
#include "modbt.h"
#include "machtimer.h"
#include "machtimer_alarm.h"
#include "mptask.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"

#include "extmod/vfs_fat.h"

#include "ff.h"
#include "diskio.h"
#include "sflash_diskio.h"

#include "lfs.h"
#include "sflash_diskio_littlefs.h"
#include "lteppp.h"
#include "esp32chipinfo.h"


/******************************************************************************
 DECLARE EXTERNAL FUNCTIONS
 ******************************************************************************/
extern void modpycom_init0(void);

/******************************************************************************
 DECLARE EXTERNAL DATA
 ******************************************************************************/
extern StackType_t *mpTaskStack;
extern TaskHandle_t svTaskHandle;

/******************************************************************************
 DECLARE PRIVATE CONSTANTS
 ******************************************************************************/
#define GC_POOL_SIZE_BYTES                                          (67 * 1024)
#define GC_POOL_SIZE_BYTES_PSRAM                                    ((2048 + 512) * 1024)

/******************************************************************************
 DECLARE PRIVATE FUNCTIONS
 ******************************************************************************/
STATIC void mptask_preinit (void);
STATIC void mptask_init_sflash_filesystem (void);
STATIC void mptask_init_sflash_filesystem_fatfs(void);
STATIC void mptask_create_main_py (void);
STATIC void mptask_init_sflash_filesystem_littlefs(void);
#if defined (LOPY) || defined (SIPY) || defined (LOPY4) || defined (FIPY)
STATIC void mptask_update_lpwan_mac_address (void);
#endif

/******************************************************************************
 DECLARE PUBLIC DATA
 ***********************************pybflash*******************************************/

fs_user_mount_t sflash_vfs_flash;

/******************************************************************************
 DECLARE PRIVATE DATA
 ******************************************************************************/
static uint8_t *gc_pool_upy;

static char fresh_main_py[] = "# main.py -- put your code here!\r\n";
static char fresh_boot_py[] = "# boot.py -- run on boot-up\r\n";

/******************************************************************************
 DEFINE PUBLIC FUNCTIONS
 ******************************************************************************/
void TASK_Micropython (void *pvParameters) {
    // initialize the garbage collector with the top of our stack
    volatile uint32_t sp = (uint32_t)get_sp();
    uint32_t gc_pool_size;
    bool soft_reset = false;
    uint32_t stack_len;

    uint8_t chip_rev = esp32_get_chip_rev();

    if (chip_rev > 0) {
        stack_len = (MICROPY_TASK_STACK_SIZE_PSRAM / sizeof(StackType_t));
    } else {
        stack_len = (MICROPY_TASK_STACK_SIZE / sizeof(StackType_t));
    }

    // configure the antenna select switch here
    antenna_init0();
    config_init0();
    mpsleep_init0();
    if (mpsleep_get_reset_cause() != MPSLEEP_DEEPSLEEP_RESET) {
        rtc_init0();
    }

    // initialization that must not be repeted after a soft reset
    mptask_preinit();
#if MICROPY_PY_THREAD
    mp_thread_preinit(mpTaskStack, stack_len, chip_rev);
    mp_irq_preinit();
#endif
    /* Creat Socket Operation task */
    modusocket_pre_init();

    // initialise the stack pointer for the main thread (must be done after mp_thread_preinit)
    mp_stack_set_top((void *)sp);

    // the stack limit should be less than real stack size, so we have a chance
    // to recover from hiting the limit (the limit is measured in bytes)
    mp_stack_set_limit(stack_len - 1024);

    if (esp32_get_chip_rev() > 0) {
        gc_pool_size = GC_POOL_SIZE_BYTES_PSRAM;
        gc_pool_upy = heap_caps_malloc(GC_POOL_SIZE_BYTES_PSRAM, MALLOC_CAP_SPIRAM);
    } else {
        gc_pool_size = GC_POOL_SIZE_BYTES;
        gc_pool_upy = heap_caps_malloc(GC_POOL_SIZE_BYTES, MALLOC_CAP_INTERNAL);
    }

    if (NULL == gc_pool_upy) {
        printf("GC pool malloc failed!\n");
        for ( ; ; );
    }

    mach_timer_alarm_preinit();
    pin_preinit();

soft_reset:

    // thread init
#if MICROPY_PY_THREAD
    mp_thread_init();
#endif

    // GC init
    gc_init((void *)gc_pool_upy, (void *)(gc_pool_upy + gc_pool_size));

    // MicroPython init
    mp_init();
    mp_obj_list_init(mp_sys_path, 0);
    mp_obj_list_init(mp_sys_argv, 0);
    mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR_)); // current dir (or base dir of the script)

    // execute all basic initializations
    pin_init0();    // always before the rest of the peripherals
#if MICROPY_PY_THREAD
    mp_irq_init0();
#endif
    uart_init0();
#ifndef RGB_LED_DISABLE
    mperror_init0();
#endif
    rng_init0();
    mp_hal_init(soft_reset);
    readline_init0();
    mod_network_init0();
    modbt_init0();
    machtimer_init0();
    modpycom_init0();
    bool safeboot = false;
    boot_info_t boot_info;
    uint32_t boot_info_offset;
    if (updater_read_boot_info (&boot_info, &boot_info_offset)) {
        safeboot = boot_info.safeboot;
    }
    if (!soft_reset) {
        if (config_get_wdt_on_boot()) {
            uint32_t timeout_ms = config_get_wdt_on_boot_timeout();
            if (timeout_ms < 0xFFFFFFFF) {
                machine_wdt_start(timeout_ms);
            } else {
                // disable the WDT on boot flag
                config_set_wdt_on_boot(false);
            }
        }
        // Config Wifi as per Pycom config
        mptask_config_wifi(false);
        // these ones are special because they need uPy running and they launch tasks
#if defined(LOPY) || defined (LOPY4) || defined (FIPY)
        modlora_init0();
#endif
#if defined(SIPY) || defined(LOPY4) || defined (FIPY)
        modsigfox_init0();
#endif
    }

