pycom/pycom-micropython-sigfox/esp32/mptask.c
    // initialize the serial flash file system
    mptask_init_sflash_filesystem();

#if defined(LOPY) || defined(SIPY) || defined (LOPY4) || defined(FIPY)
    // must be done after initializing the file system
    mptask_update_lpwan_mac_address();
#endif

#if defined(SIPY) || defined(LOPY4) || defined(FIPY)
    sigfox_update_id();
    sigfox_update_pac();
    sigfox_update_private_key();
    sigfox_update_public_key();
#endif

    // append the flash paths to the system path
    mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR__slash_flash));
    mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR__slash_flash_slash_lib));

    // reset config variables; they should be set by boot.py
    MP_STATE_PORT(machine_config_main) = MP_OBJ_NULL;

    pyexec_frozen_module("_boot.py");

    if (!soft_reset) {
    #if defined(GPY) || defined (FIPY)
        modlte_init0();
        if(config_get_lte_modem_enable_on_boot())
        {
            // Notify the LTE thread to start
            modlte_start_modem();
        }
    #endif
    }

    if (!safeboot) {
        // run boot.py
        int ret = pyexec_file("boot.py");
        if (ret & PYEXEC_FORCED_EXIT) {
            goto soft_reset_exit;
        }
        if (!ret) {
#ifndef RGB_LED_DISABLE
            // flash the system led
            mperror_signal_error();
#endif
        }
    }

    if (!safeboot) {
        // execute the frozen main first

#if (VARIANT == PYBYTES)
        if (config_get_pybytes_autostart()) {
            pyexec_frozen_module("_main_pybytes.py");
        } else {
            pyexec_frozen_module("_main.py");
        }
#else
        pyexec_frozen_module("_main.py");
#endif

        // run the main script from the current directory.
        if (pyexec_mode_kind == PYEXEC_MODE_FRIENDLY_REPL) {
            const char *main_py;
            if (MP_STATE_PORT(machine_config_main) == MP_OBJ_NULL) {
                main_py = "main.py";
            } else {
                main_py = mp_obj_str_get_str(MP_STATE_PORT(machine_config_main));
            }
            int ret = pyexec_file(main_py);
            if (ret & PYEXEC_FORCED_EXIT) {
                goto soft_reset_exit;
            }
            if (!ret) {
#ifndef RGB_LED_DISABLE
                // flash the system led
                mperror_signal_error();
#endif
            }
        }
    }

    // main script is finished, so now go into REPL mode.
    // the REPL mode can change, or it can request a soft reset.
    for ( ; ; ) {
        if (pyexec_mode_kind == PYEXEC_MODE_RAW_REPL) {
            if (pyexec_raw_repl() != 0) {
                break;
            }
        } else {
            if (pyexec_friendly_repl() != 0) {
                break;
            }
        }
    }

soft_reset_exit:

    machtimer_deinit();
#if MICROPY_PY_THREAD
    mp_irq_kill();
    mp_thread_deinit();
#endif
    mpsleep_signal_soft_reset();
    mp_printf(&mp_plat_print, "PYB: soft reboot\n");
    // it needs to be this one in order to not mess with the GIL
    ets_delay_us(5000);

    uart_deinit_all();
    // TODO: rmt_deinit_all();
    rmt_deinit_rgb();

    soft_reset = true;
    goto soft_reset;
}

bool isLittleFs(const TCHAR *path){
#ifndef FS_USE_LITTLEFS
    if (config_get_boot_fs_type() == 0x01) {
#endif
        const char *flash = "/flash";
        if(strncmp(flash, path, sizeof(flash)-1) == 0) {
            return true;
        }
#ifndef FS_USE_LITTLEFS
    }
#endif
    return false;
}

/******************************************************************************
 DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/
STATIC void mptask_preinit (void) {
    wlan_pre_init();
    //TODO: Re-check this: increased stack is needed by modified FTP implementation due to LittleFS vs FatFs
    xTaskCreatePinnedToCore(TASK_Servers, "Servers", 2*SERVERS_STACK_LEN, NULL, SERVERS_PRIORITY, &svTaskHandle, 1);
}

STATIC void mptask_init_sflash_filesystem(void) {
    if (config_get_boot_fs_type() == 0x01) {
        //printf("Initializing filesystem as LittleFS!\n");
        mptask_init_sflash_filesystem_littlefs();
    }
    else {
        //printf("Initializing filesystem as FatFS!\n");
        mptask_init_sflash_filesystem_fatfs();
    }
}

STATIC void mptask_init_sflash_filesystem_fatfs(void) {
    // Initialise the local flash filesystem.
    // init the vfs object
    fs_user_mount_t *vfs_fat = &sflash_vfs_flash;
    vfs_fat->flags = 0;
    pyb_flash_init_vfs(vfs_fat);

    FILINFO fno;

    // Create it if needed, and mount it on /flash.
    FRESULT res = f_mount(&vfs_fat->fs.fatfs);
    if (res == FR_NO_FILESYSTEM) {
        // no filesystem, so create a fresh one
        uint8_t working_buf[FF_MAX_SS];
        res = f_mkfs(&vfs_fat->fs.fatfs, FM_SFD | FM_FAT, 0, working_buf, sizeof(working_buf));
        if (res != FR_OK) {
            __fatal_error("failed to create /flash");
        }
        // create empty main.py
        mptask_create_main_py();
    }
    else if (res == FR_OK) {
        // mount sucessful
        if (FR_OK != f_stat(&vfs_fat->fs.fatfs, "/main.py", &fno)) {
            // create empty main.py
            mptask_create_main_py();
        }
    } else {
        __fatal_error("failed to create /flash");
    }

    // mount the flash device (there should be no other devices mounted at this point)
    // we allocate this structure on the heap because vfs->next is a root pointer
    mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
    if (vfs == NULL) {
        __fatal_error("failed to create /flash");
    }
    vfs->str = "/flash";
    vfs->len = 6;
    vfs->obj = MP_OBJ_FROM_PTR(vfs_fat);
    vfs->next = NULL;
    MP_STATE_VM(vfs_mount_table) = vfs;

    // The current directory is used as the boot up directory.
    // It is set to the internal flash filesystem by default.
    MP_STATE_PORT(vfs_cur) = vfs;

    // create /flash/sys, /flash/lib and /flash/cert if they don't exist
    if (FR_OK != f_chdir (&vfs_fat->fs.fatfs, "/sys")) {
        f_mkdir(&vfs_fat->fs.fatfs, "/sys");
    }
    if (FR_OK != f_chdir (&vfs_fat->fs.fatfs, "/lib")) {
        f_mkdir(&vfs_fat->fs.fatfs, "/lib");
    }
    if (FR_OK != f_chdir (&vfs_fat->fs.fatfs, "/cert")) {
        f_mkdir(&vfs_fat->fs.fatfs, "/cert");
    }

    f_chdir(&vfs_fat->fs.fatfs, "/");

    // make sure we have a /flash/boot.py. Create it if needed.
    res = f_stat(&vfs_fat->fs.fatfs, "/boot.py", &fno);
    if (res == FR_OK) {
        if (fno.fattrib & AM_DIR) {
            // exists as a directory
            // TODO handle this case
            // see http://elm-chan.org/fsw/ff/img/app2.c for a "rm -rf" implementation
        } else {
            // exists as a file, good!
        }
    } else {
        // doesn't exist, create fresh file
        FIL fp;
        f_open(&vfs_fat->fs.fatfs, &fp, "/boot.py", FA_WRITE | FA_CREATE_ALWAYS);
        UINT n;
        f_write(&fp, fresh_boot_py, sizeof(fresh_boot_py) - 1 /* don't count null terminator */, &n);
        // TODO check we could write n bytes
        f_close(&fp);
    }
}

STATIC void mptask_init_sflash_filesystem_littlefs(void) {

    fs_user_mount_t* vfs_littlefs = &sflash_vfs_flash;
    lfs_t *littlefsptr = &(vfs_littlefs->fs.littlefs.lfs);

    //Initialize the block device
    sflash_disk_init();
    //Initialize the VFS object with the block device's functions
    pyb_flash_init_vfs_littlefs(vfs_littlefs);

    if(spi_flash_get_chip_size() > (4* 1024 * 1024))
    {
        lfscfg.block_count = SFLASH_BLOCK_COUNT_8MB;
        lfscfg.lookahead_size = (SFLASH_BLOCK_COUNT_8MB/8);
    }
    else
    {
        lfscfg.block_count = SFLASH_BLOCK_COUNT_4MB;
        lfscfg.lookahead_size = 32;
    }

    // Mount the file system if exists
    if(LFS_ERR_OK != lfs_mount(littlefsptr, &lfscfg))
    {
        // File system does not exist, create it and mount
        if(LFS_ERR_OK == lfs_format(littlefsptr, &lfscfg))
        {
            if(LFS_ERR_OK != lfs_mount(littlefsptr, &lfscfg))
            {
                __fatal_error("failed to create /flash");
            }
        }
        else
        {
            __fatal_error("failed to create /flash");
        }
    }

    // mount the flash device (there should be no other devices mounted at this point)
    // we allocate this structure on the heap because vfs->next is a root pointer
    mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
    if (vfs == NULL) {
        __fatal_error("failed to create /flash");
    }
    vfs->str = "/flash";
    vfs->len = 6;
    vfs->obj = MP_OBJ_FROM_PTR(vfs_littlefs);
    vfs->next = NULL;
    MP_STATE_VM(vfs_mount_table) = vfs;

    // The current directory is used as the boot up directory.
    // It is set to the internal flash filesystem by default.
    MP_STATE_PORT(vfs_cur) = vfs;

    //Initialize the current working directory (cwd)
    vfs_littlefs->fs.littlefs.cwd = (char*)pvPortMalloc(2);
    vfs_littlefs->fs.littlefs.cwd[0] = '/';
    vfs_littlefs->fs.littlefs.cwd[1] = '\0';

