pycom/pycom-micropython-sigfox/esp32/mptask.c
    MP_STATE_PORT(lfs_cwd) = vfs_littlefs->fs.littlefs.cwd;
    vfs_littlefs->fs.littlefs.mutex = xSemaphoreCreateMutex();

    xSemaphoreTake(vfs_littlefs->fs.littlefs.mutex, portMAX_DELAY);

    // create empty main.py if does not exist
    lfs_file_t fp;
    lfs_ssize_t n = 0;

    if(LFS_ERR_OK == lfs_file_open(littlefsptr, &fp, "/main.py", LFS_O_WRONLY | LFS_O_CREAT | LFS_O_EXCL))
    {
        //Create empty main.py if does not exist
        n = lfs_file_write(littlefsptr, &fp, fresh_main_py, sizeof(fresh_main_py) - 1 /* don't count null terminator */);
        lfs_file_close(littlefsptr, &fp);
        if(n != sizeof(fresh_main_py) - 1)
        {
            __fatal_error("failed to create main.py");
        }

        // Save the time of creation
        littlefs_update_timestamp(littlefsptr, "/main.py");
    }

    // create empty boot.py if does not exist
    if(LFS_ERR_OK == lfs_file_open(littlefsptr, &fp, "/boot.py", LFS_O_WRONLY | LFS_O_CREAT | LFS_O_EXCL))
    {
        //Create empty boot.py if does not exist
        n = lfs_file_write(littlefsptr, &fp, fresh_boot_py, sizeof(fresh_boot_py) - 1 /* don't count null terminator */);
        lfs_file_close(littlefsptr, &fp);
        if(n != sizeof(fresh_boot_py) - 1)
        {
            __fatal_error("failed to create boot.py");
        }

        // Save the time of creation
        littlefs_update_timestamp(littlefsptr, "/boot.py");
    }

    // create /flash/sys, /flash/lib and /flash/cert if they don't exist
    if(LFS_ERR_OK == lfs_mkdir(littlefsptr,"/sys")) {
        // Save the time of creation
        littlefs_update_timestamp(littlefsptr, "/sys");
    }
    if(LFS_ERR_OK == lfs_mkdir(littlefsptr,"/lib")) {
        // Save the time of creation
        littlefs_update_timestamp(littlefsptr, "/lib");
    }
    if(LFS_ERR_OK == lfs_mkdir(littlefsptr,"/cert")) {
        // Save the time of creation
        littlefs_update_timestamp(littlefsptr, "/cert");
    }

    xSemaphoreGive(vfs_littlefs->fs.littlefs.mutex);
}


#if defined(LOPY) || defined(SIPY) || defined (LOPY4) || defined(FIPY)
STATIC void mptask_update_lpwan_mac_address (void) {
    #define LPWAN_MAC_ADDR_PATH          "/sys/lpwan.mac"

    if (config_get_boot_fs_type() == 0x00) {

        FILINFO fno;
        FATFS* fsptr = &sflash_vfs_flash.fs.fatfs;

        if (FR_OK == f_stat(fsptr, LPWAN_MAC_ADDR_PATH, &fno)) {
            FIL fp;
            f_open(fsptr, &fp, LPWAN_MAC_ADDR_PATH, FA_READ);
            UINT sz_out;
            uint8_t mac[8];
            FRESULT res = f_read(&fp, mac, sizeof(mac), &sz_out);
            if (res == FR_OK) {
                // file found, update the MAC address
                if (config_set_lpwan_mac(mac)) {
                    mp_hal_delay_ms(250);
                    ets_printf("LPWAN MAC write OK\n");
                } else {
                    res = FR_DENIED;    // just anything different than FR_OK
                }
            }
            f_close(&fp);
            if (res == FR_OK) {
                // delete the mac address file
                f_unlink(fsptr, LPWAN_MAC_ADDR_PATH);
            }
        }
    }
    else {

        lfs_file_t fp;
        lfs_t* fsptr = &sflash_vfs_flash.fs.littlefs.lfs;

        xSemaphoreTake(sflash_vfs_flash.fs.littlefs.mutex, portMAX_DELAY);

        if(LFS_ERR_OK == lfs_file_open(fsptr, &fp, LPWAN_MAC_ADDR_PATH, LFS_O_RDONLY)){
            uint8_t mac[8];
           int sz_out = lfs_file_read(fsptr, &fp, mac, sizeof(mac));
           if (sz_out > LFS_ERR_OK) {
               // file found, update the MAC address
               if (config_set_lpwan_mac(mac)) {
                   mp_hal_delay_ms(250);
                   ets_printf("LPWAN MAC write OK\n");
               }
           }
           lfs_file_close(fsptr, &fp);
           if (sz_out > LFS_ERR_OK) {
               // delete the mac address file
               lfs_remove(fsptr, LPWAN_MAC_ADDR_PATH);
           }
       }

        xSemaphoreGive(sflash_vfs_flash.fs.littlefs.mutex);

    }
}
#endif

void mptask_config_wifi(bool force_start)
{
    uint8_t mode = config_get_wifi_mode();
    uint8_t auth = config_get_wifi_auth();
    bool wifi_on_boot = config_get_wifi_on_boot();
    bool antenna;
    char ssid_station [33];
    char pwd_station[65];
    char ssid_accessPoint [33];
    char pwd_accessPoint[65];
    char * ssid_sta = NULL;
    char * pwd_sta = NULL;
    char * ssid_ap = NULL;
    char * pwd_ap = NULL;

    switch(mode)
    {
    case PYCOM_WIFI_CONF_MODE_STA:
        mode = WIFI_MODE_STA;
        break;
    case PYCOM_WIFI_CONF_MODE_AP:
        mode = WIFI_MODE_AP;
        break;
    case PYCOM_WIFI_CONF_MODE_APSTA:
        mode = WIFI_MODE_APSTA;
        break;
    default:
        mode = WIFI_MODE_AP;
        config_set_wifi_mode((uint8_t)PYCOM_WIFI_CONF_MODE_AP, true);
        break;
    }

    if(auth >= WIFI_AUTH_MAX)
    {
        auth = (uint8_t)WIFI_AUTH_WPA2_PSK;
        config_set_wifi_auth(auth, true);
    }
    if(true == config_get_wifi_antenna())
    {
        antenna = ANTENNA_TYPE_INTERNAL;
    }
    else
    {
        antenna = ANTENNA_TYPE_EXTERNAL;
    }

    if (force_start || wifi_on_boot)
    {
        switch(mode)
        {
            case WIFI_MODE_STA:
            case WIFI_MODE_APSTA:

                // Get STA ssid and password
                if(config_get_wifi_sta_ssid((uint8_t*)ssid_station))
                {
                    ssid_sta = ssid_station;
                }
                if(config_get_wifi_sta_pwd((uint8_t*)pwd_station))
                {
                    pwd_sta = pwd_station;
                }

                // Get AP ssid and password
                if(config_get_wifi_ap_ssid((uint8_t*)ssid_accessPoint))
                {
                    ssid_ap = ssid_accessPoint;
                }
                if(config_get_wifi_ap_pwd((uint8_t*)pwd_accessPoint))
                {
                    pwd_ap = pwd_accessPoint;
                }

                wlan_internal_setup_t setup_sta_ap = {
                        mode,
                        ssid_sta,
                        pwd_sta,
                        ssid_ap,
                        pwd_ap,
                        (uint32_t)auth,
                        0,
                        antenna,
                        true,
                        false,
                        WIFI_BW_HT40,
                        NULL,
                        NULL
                };

                if ((ssid_sta != NULL) || (ssid_ap != NULL)) {
                    wlan_setup (&setup_sta_ap);
                }

                break;

            case WIFI_MODE_AP:

                if(!config_get_wifi_ap_ssid((uint8_t*)ssid_accessPoint))
                {
                    ssid_ap = DEFAULT_AP_SSID;
                    pwd_ap = DEFAULT_AP_PASSWORD;
                }
                else
                {
                    ssid_ap = ssid_accessPoint;
                    if(config_get_wifi_ap_pwd((uint8_t*)pwd_accessPoint))
                    {
                        pwd_ap = pwd_accessPoint;
                        if(strlen(pwd_ap) == 0)
                        {
                            auth = WIFI_AUTH_OPEN;
                        }
                    }
                    else
                    {
                        auth = WIFI_AUTH_OPEN;
                    }
                }

                wlan_internal_setup_t setup_ap = {
                        mode,
                        NULL,
                        NULL,
                        ssid_ap,
                        pwd_ap,
                        (uint32_t)auth,
                        DEFAULT_AP_CHANNEL,
                        antenna,
                        true,
                        false,
                        WIFI_BW_HT40,
                        NULL,
                        NULL
                };

                wlan_setup (&setup_ap);

                break;
            default:
                break;

        }
    }
}

STATIC void mptask_create_main_py (void) {
    // create empty main.py
    FIL fp;
    f_open(&sflash_vfs_flash.fs.fatfs, &fp, "/main.py", FA_WRITE | FA_CREATE_ALWAYS);
    UINT n;
    f_write(&fp, fresh_main_py, sizeof(fresh_main_py) - 1 /* don't count null terminator */, &n);
    f_close(&fp);
}

void stoupper (char *str) {
    while (str && *str != '\0') {
        *str = (char)toupper((int)(*str));
        str++;
    }
}
